#include <stdio.h>
#include <windows.h>
int main()
{
    signed char i;   // 负数常用补码表示，负数(补码)是其绝对值的二进制取反加1，
    unsigned char j; /*负数转化为十进制时，比如 1011 1100，那么符号位的权值就应该乘以 -1
                    比如1011 1100的转化过程-1 * 2^7 + 0 * 2^6 + 1 * 2^5 + 1 * 2^4 + 1 * 2^3 + 1 * 2^2 + 0 * 2^1 + 0 * 2^0*/

    i = 255; // float 4字节,取值范围为1.2E-38 到 3.4E+38 或-3.4E+38 到 -1.2E-38，(通常只给出绝对值的范围) 有效数字为6~7 位
    j = 255; // double为8字节,取值范围为2.3E-308 到 1.7E+308	有效数字为15~16位
    // long double为12字节，取值范围为3.4E-4932 到 1.1E+4932	有效数字为18~19位(或更多)

    printf("signed char %hhd\n", i);   // 使用 hh 说明其长度  1个字节8位，范围为-128~127
    printf("unsigned char %hhu\n", j); // 范围为0~255，所占长度为255个bit
    system("pause");
    return 0;
}