#include <stdio.h>
#include <windows.h>
int main()
{
    SetConsoleOutputCP(CP_UTF8);
    int r;   // 圆的半径
    float c; // 圆的周长
    float s; // 圆的面积
    r = 5;
    c = 2 * 3.14 * r;
    s = 3.14 * r * r;
    printf("半径%d的圆的周长是%.2f,面积是%.2f\n", r, c, s);         // 一个打印输出有多个变量时全部放在末尾，用逗号隔开
    printf("打印五个字符:%c %c %c %c %c\n", 70, 105, 115, 104, 67); // 可直接打印ASCII码
    printf("前边用 填充:%10d\n", 2015);                             // 打印输出后面可直接跟被代替的数字，不一定非要是变量
    printf("前面用0填充:%010d\n", 2015);                            //%010d表示最小占10个字符，前面用0填充，%10d前面用空格填充
    printf("右对齐,保留2位:%10.2f\n", 3.14);
    printf("左对齐,保留3位:%.3f\n", 3.142);
    printf("右对齐,指数形式:%10e\n", 520000.0);  // 默认情况下是右对齐，取指数用%e，10代表要占的最小字符数，e：科学计数法的符号，占 1 个字符。
    printf("左对齐,指数形式:%-10E\n", 520000.0); //%-E变成左对齐，+005：指数部分，占4个字符，代表10的-5次方，正数用%e，负数用%-E
    system("pause");
    return 0;
}